<?php

$arr = [1, 34, 65, 3, 4, 79];
for ($i = 0; $i < count($arr); $i++) {
    echo $arr[$i];
}
echo '<br><br>';

foreach ($arr as $key => $value) {
    echo "($key => $value)<br>";
}
echo '<br><br>';

$arr = [
    'Первая категория' => [
        'Первая подкатегория' => ['первый', 'второй', 'третий'],
        'Вторая подкатегория' => ['первый', 'второй']
    ],
    'Вторая категория' => [
        'Первая подкатегория' => ['первый', 'второй', 'третий'],
        'Вторая подкатегория' => ['первый', 'второй'],
        'Третья подкатегория' => ['первый', 'второй', 'третий', 'четвертый']
    ],
    'Третья категория' => [
        'Первая подкатегория' => [
            'Первая подподкатегория' => [1, 2, 3],
            'Вторая подподкатегория' => [1, 2, 3, 4, 'пять']
        ]
    ]
];

// foreach ($arr as $key => $first) {
//     echo "<b>$key</b>";
    
//     foreach ($first as $key => $second) {
//         echo "<li>$key</li>";
        
//         foreach ($second as $key => $third) {
//             if (is_numeric($key)) {
//                 echo "<ul>$third</ul>";
//             }
//             else {
//                 echo "<ol>$key</ol>";

//                 foreach ($third as $item) {
//                     echo "<ol>$item</ol>";
//                 }
//             }
//         }
//     }
// }

$ship = [
    'Пассажирские корабли' => ['Лайнер', 'Яхта', 'Паром'],
    'Военные корабли' => ['Авианосец', 'Линкор', 'Эсминец'],
    'Грузовые корабли' => ['Сормовский', 'Волго-Дон', 'Окский']
];

foreach ($ship as $key => $type) {
    echo "<b>$key</b><br />";
    foreach ($type as $ship) {
        echo "<li>$ship</li>";
    }
}
